[
    {
        "title": "Wartorn",
        "trailer": "https://www.youtube.com/embed/014IEmJHhLc",
        "job-title": "Gameplay Engineer | Programming Lead",
        "tools": "(Unreal | PC)",
        "description": "A narrative-driven game where players control a child separated from their parents during a war, exploring a ruined city to gather supplies and search for clues about their parents' whereabouts.",
        "game-link": "https://dnajerab.itch.io/wartorn",

        "title-background-image": "url('../src/assets/Projects/Wartorn/WartornTitleBackground.png')",
        "task-section-background-color": "radial-gradient(circle farthest-side, #db6836, #552713)",
        "jobs-section": [
            {
                "title": "Dialogue System",
                "jobs": [
                    "Designed and developed a dynamic and flexible Dialogue System enabling writers and designers to create and modify dialogue sequences with ease, ensuring adaptability throughout the development process.",
                    "Implemented support for Dialogue Trees to offer players meaningful choices and enhance player immersion.",
                    "Collaborated closely with writers and designers to ensure the system exposed essential properties and options for them to create their compelling stories."
                ]
            },
            {
                "title": "Dialogue System's UI",
                "jobs": [
                    "Developed modular UI Components for diverse dialogue scenarios using Unreal Engine's UI framework (widgets, canvas, and text elements)."
                ]
            },
            {
                "title": "Visual Effects",
                "jobs": [
                    "Collaborated closely with VFX members to integrate and synchronize weapon and ability effects across the network, ensuring consistency and visual fidelity during gameplay."
                ] 
            }
        ],
    "gifs-section": 
        [
            {
                "gif": "src/assets/Projects/Wartorn/DialogueTreeWartorn.gif",
                "caption": "Fade in and fade out effect"
            },
            {
                "gif": "src/assets/Projects/Wartorn/DialogueTreeWartorn2.gif",
                "caption": "Dialogue Tree showcase"
            },
            {
                "gif": "src/assets/Projects/Wartorn/TypeWriterEffectWartorn.gif",
                "caption": "Type writing Effect"
            }               
        ],

        "thoughts": "Working on this project was my introduction to Unreal Engine, where I learned the basics of the platform. I explored Unreal’s Blueprint system and UI tools, gaining hands-on experience. Though my role was relatively small, I created a flexible and efficient dialogue system that greatly benefited the writers and improved the team's workflow."
    },
    {
        "title": "QuickShot",
        "trailer": "",
        "job-title": "Gameplay Engineer | Programming Lead",
        "tools": "(Unity | PC)",
        "description": "A fast-paced multiplayer FPS where players use a sniper rifle, dash, and grapple hook to outmaneuver opponents and dominate the arena in free-for-all battles.",
        "game-link": "https://dtrmgiraffe.itch.io/quickshot",

        "title-background-image": "url('../src/assets/Projects/Quickshot/title-background.png')",
        "task-section-background-color": "radial-gradient(circle closest-corner, #5A2C80, #35194B)",
        "jobs-section": [
            {
                "title": "Weapon System",
                "jobs": [
                    "Developed a shooting system supporting both hit-scan and non-hit-scan modes.",
                    "Implemented a mode-swapping feature, enabling seamless transitions between weapon types.",
                    "Built a flexible weapon configuration system that allowed designers to adjust parameters like damage multipliers, fire rate, and swap time dynamically."
                ]
            },
            {
                "title": "Gameplay System",
                "jobs": [
                    "Developed a respawn system for managing players spawning within the maps.",
                    "Created a data storage system to track and propagate essential player statistics across the network.",
                    "Developed a modern lobby system where players could view their characters alongside others in real time."
                ]
            },
            {
                "title": "Network",
                "jobs": [
                    "Engineered systems to synchronize critical data (e.g., health, time, score, abilities, and shooting events) across all clients in the match.",
                    "Created serialization methods to support the transmission of non-default data types over Photon’s networking framework.",
                    "Developed backend functionality for a lobby system, enabling players to find and join active games or lobbies.",
                    "Used Photon’s networking framework to balance the authority of the master client (server) over the other clients in the match."
                ]
            },
            {
                "title": "UI",
                "jobs": [
                    "Collaborated with UI designers to create a flexible system responsive to user input and game data, such as the scoreboard, main menu, health indicators, and final screens."
                ]
            },
            {
                "title": "Visual Effects",
                "jobs": [
                    "Collaborated closely with VFX members to integrate and synchronize weapon and ability effects across the network, ensuring consistency and visual fidelity during gameplay."
                ]
            }
        ],
        "gifs-section": 
            [
                {
                    "gif": "src/assets/Projects/Quickshot/JoiningLobby.gif",
                    "caption": "Players joining lobbies already created/started"
                },
                {
                    "gif": "src/assets/Projects/Quickshot/LobbyPlayers.gif",
                    "caption": "Players hosting lobbies other players can join"
                },
                {
                    "gif": "src/assets/Projects/Quickshot/DashEffect.gif",
                    "caption": "Dash Effect in first and third person view"
                },
                {
                    "gif": "src/assets/Projects/Quickshot/HitScanProjectile.gif",
                    "caption": "Hit-scan and Non-hit-scan modes showcase"
                }               
            ],

        "thoughts": "This was my first experience working on a shooting game, where I played a key role in its development. Through this project, I deepened my understanding of networking in games, tackling challenges like latency and synchronization. While there’s still more work to be done, I’m proud of what my team and I achieved within the time constraints. I look forward to revisiting this project to refine it further and potentially release it on Steam for others to enjoy—especially since we’ve already had people asking for it! 😉"
    },
    {
        "title": "DawnCore",
        "trailer": "",
        "job-title": "Gameplay Engineer | Programming Lead",
        "tools": "(Unreal | PC)",
        "description": "Need to do this ahhh",
        "game-link": "https://dtrmgiraffe.itch.io/quickshot",

        "title-background-image": "url('../src/assets/Projects/DawnCore/title-background.jpg')",
        "task-section-background-color": "radial-gradient(circle closest-corner, #B09D74, #827455)",
        "jobs-section": [
            {
                "title": "Software Engineering",
                "jobs": [
                    "Developed a detailed UML diagram that outlined the game's systems, providing a clear architectural guide for fellow programmers and ensuring consistent development across all features."
                ]
            },
            {
                "title": "Movement System",
                "jobs": [
                    "Designed and implemented a movement system capable of seamlessly transitioning between modes while preserving player momentum.",
                    "Applied linear algebra to calculate movement vectors on angled slopes and curved walls, ensuring smooth and realistic traversal.",
                    "Worked closely with designers to offer flexibility in configuring movement mechanics, including transitions and customizable settings tailored to gameplay needs."
                ]
            },
            {
                "title": "Health System",
                "jobs": [
                    "Built a robust health system supporting diverse mechanics, including healing and damage over time, invincibility modes, health regeneration, and handling simple respawning."
                ]
            },
            {
                "title": "“AI Director”",
                "jobs": [
                    "Developed an algorithm for procedurally spawning enemies in designated areas based on designer-defined metrics.",
                    "Designed and developed a complex dynamic pacing algorithm to create peaks and valleys of “emotional intensity” for the player."
                ]
            }
        ],
        "gifs-section": 
            [
                {
                    "gif": "src/assets/Projects/Quickshot/JoiningLobby.gif",
                    "caption": "Movement Showcase: Sliding and Wall Climbing"
                },
                {
                    "gif": "src/assets/Projects/Quickshot/LobbyPlayers.gif",
                    "caption": "Movement Showcase: Wall Running"
                },
                {
                    "gif": "src/assets/Projects/Quickshot/DashEffect.gif",
                    "caption": "UML of the current architecture of our game"
                },
                {
                    "gif": "src/assets/Projects/Quickshot/HitScanProjectile.gif",
                    "caption": "Health System"
                }               
            ],

        "thoughts": "This is my current capstone project, which is still in development, where I play a key role in both its development and software architecture. It marks my first experience working on a complex movement system, implementing advanced mechanics such as wall climbing, wall running, and sliding. Through this project, I’ve gained deeper knowledge of Unreal Engine, utilizing both C++ and Blueprints. I’ve learned to evaluate the strengths and weaknesses of each system and determine their best applications for various gameplay mechanics, particularly those focused on functionality rather than code structure or efficiency. Additionally, this project has strengthened my foundation in Linear Algebra, which has been essential for implementing many of the movement mechanics. Although there’s still much work ahead, I’m proud of what my team has achieved so far."
    }
    
]