[
    {
        "title": "Wartorn",
        "trailer": "https://www.youtube.com/embed/OQ1CwPhE8KQ",
        "job-title": "Gameplay Engineer | Programming Lead",
        "tools": "(Unity | PC)",
        "description": "A sniper free-for-all (FFA) game, where the sniper is inspired from Overwatch's character, Ana.",
        "jobs-section":
            [
                {
                    "title": "Dialogue System",
                    "jobs": [
                        "Designed and developed a dynamic and flexible Dialogue System enabling writers and designers to create and modify dialogue sequences with ease, ensuring adaptability throughout the development process.",
                        "Implemented support for Dialogue Trees to offer players meaningful choices and enhance player immersion.",
                        "Collaborated closely with writers and designers to ensure the system exposed essential properties and options for them to create their compelling stories."
                    ]
                },
                {
                    "title": "Dialogue System's UI",
                    "jobs": [
                        "Developed modular UI Components for diverse dialogue scenarios using Unreal Engine's UI framework (widgets, canvas, and text elements)."
                    ]
                },
                {
                    "title": "Visual Effects",
                    "jobs": [
                        "Created a typewriter effect for dialogue text to enhance immersion.",
                        "Implemented smooth fade-in and fade-out animations for text boxes, improving overall aesthetic and readability."
                    ] 
                }
            ],
        "gifs-section": 
            [
                {
                    "gif": "src/assets/DialogueTreeWartorn.gif",
                    "caption": "Fade in and fade out effect"
                },
                {
                    "gif": "src/assets/DialogueTreeWartorn2.gif",
                    "caption": "Dialogue Tree showcase"
                },
                {
                    "gif": "src/assets/TypeWriterEffectWartorn.gif",
                    "caption": "TypeWriting Effect"
                }               
            ],
        "thoughts": "This was my first Unreal Project and although I had a small part on it I was able to learn the basics of Unreal and getting experience using Unreal's blueprint system."
    }


]