[
    {
        "title": "UCI Search Engine",
        "trailer": "",
        "task-section-title": "Software Developer",
        "job-title": "Software Developer | Search Engineer",
        "tools": "(Python | Threads | Regex | Github | GitKraken)",
        "description": "A small scale search engine for UCI documents",
        "game-link": "https://github.com/JMx36/IR24W-A3-G36",

        "title-background-image": "url('assets/Projects/SoftwareDev/Search-Engine/title-background.png')",
        "task-section-background-color": "radial-gradient(circle farthest-side, #B19306, #045488)",
        "jobs-section": [
            {
                "title": "Search Engine Development",
                "jobs": [
                    "Designed and implemented a scalable search engine",
                    "Built from the ground up to handle tens of thousands of documents.",
                    "Achieved a query response time consistently under 300ms, even under harsh operational constraints."
                ]
            },
            {
                "title": "Multithreaded File Processing and Indexing System",
                "jobs": [
                    "Leveraged multithreading to parse large volumes of files concurrently, adhering to threading best practices to ensure thread safety and prevent simultaneous memory access conflicts.",
                    "Ensured efficient and concurrent creation of inverted indexes to improve scalability and performance."
                ]
            },
            {
                "title": "Inverted Index Retrieval",
                "jobs": [
                    "Implemented an Index-of-Index as a JSON-based metadata structure to store the byte offset of the beginning of the inverted index for each tokenized word.",
                    "Enabled direct access to specific word data during query processing, significantly reducing lookup times.",
                    "Optimized the storage format to ensure compactness and quick parsing of the JSON file."
                ]
            },
            {
                "title": "Custom Text-Based Saving System",
                "jobs": [
                    "Optimized for efficiently storing inverted indexes with minimal overhead.",
                    "Designed with a focus on supporting rapid merging of inverted indexes for distributed or incremental updates."
                ]
            },
            {
                "title": "Document Scoring Algorithms",
                "jobs": [
                    "Integrated PageRank, HITS, SimHashing, and tf-idf scoring methodologies.",
                    "Enhanced relevance ranking by incorporating weighting for key HTML tags such as <title>, <h1>, and <meta> descriptions."
                ]
            }
        ],
        
        "gifs-section": 
        [
            {
                "gif": "assets/Projects/SoftwareDev/Search-Engine/MSE.gif",
                "caption": "Keyword: \"Master In Software Engineering\""
            },    
            {
                "gif": "assets/Projects/SoftwareDev/Search-Engine/CyberSecurity.gif",
                "caption": "Keyword: \"Cybersecurity\""
            },   
            {
                "gif": "assets/Projects/SoftwareDev/Search-Engine/Professors.gif",
                "caption": "Keyword: \"Professors at UCI\""
            },   
            {
                "gif": "assets/Projects/SoftwareDev/Search-Engine/Code.gif",
                "caption": "Keyword: \"Girls who code\""
            }          
        ],

        "thoughts": "Developing this search engine was a valuable learning experience. It significantly enhanced my threading skills as I worked with multiple threads running concurrently and accessing shared data structures like dictionaries and queues. I also honed my ability to write efficient code, ensuring the system could process large volumes of data while maintaining a 300ms response time. Additionally, this project provided meaningful experience in collaborating with other programmers, focusing on writing clear, maintainable code that integrates seamlessly with others’ contributions."
    }, 
    {
        "title": "Portfolio Website",
        "trailer": "",
        "task-section-title": "Web Developer",
        "job-title": "Web Developer | Frontend Developer",
        "tools": "(JavaScript | React | Html | Css | Github | GitKraken)",
        "description": "Personal Portfolio website showcasing all the projects I have worked on.",
        "game-link": "https://github.com/JMx36/IR24W-A3-G36",

        "title-background-image": "url('assets/Projects/SoftwareDev/Portfolio/title-background.jpg')",
        "task-section-background-color": "radial-gradient(circle farthest-side, #BEA12F, #141515)",
        "jobs-section": [
            {
                "title": "Website Development with ReactJS",
                "jobs": [
                    "Leveraged core React fundamentals such as functional and class components, states, props, lifecycle methods, and hooks like useEffect and useState.",
                    "Implemented timeouts and intervals for dynamic interactions like animations, timed updates, and event handling.",
                    "Followed React's component-based architecture to ensure modular, maintainable, and reusable code."
                ]
            },
            {
                "title": "Utilized React Libraries to Enhance Functionality",
                "jobs": [
                    "Implemented react-router-dom to enable client-side routing, creating a seamless navigation experience with features like nested routes.",
                    "Incorporated react-responsive for device-specific rendering and media query handling, ensuring an adaptive user experience across devices."
                ]
            },
            {
                "title": "Responsive Website Layout Design",
                "jobs": [
                    "Crafted visually appealing interfaces using semantic HTML and modern CSS methodologies like Flexbox and Grid.",
                    "Ensured responsiveness by utilizing relative units (e.g., percentages, viewport width/height) and CSS math functions like calc().",
                    "Applied media queries to adapt layouts for diverse screen sizes and orientations."
                ]
            },
            {
                "title": "Dynamic Content and Interactive Features",
                "jobs": [
                    "Created interactive components like image sliders, typing/writing animations, and hover-based transitions.",
                    "Implemented real-time color-changing effects using state management and event listeners.",
                    "Designed smooth user interactions using React's event-handling system."
                ]
            },
            {
                "title": "Integration of Third-Party Libraries",
                "jobs": [
                    "Utilized EmailJS to implement an automated email-sending feature, enabling users to send messages directly from the website without requiring a backend server.",
                    "Incorporated form validation to ensure the accuracy and completeness of user inputs before sending emails."
                ]
            }
        ],
        
        "gifs-section": 
        [

            {
                "gif": "assets/Projects/SoftwareDev/Portfolio/TypeWritingEffect.gif",
                "caption": "Type writing effect"
            },
            {
                "gif": "assets/Projects/SoftwareDev/Portfolio/ReusableComponents.gif",
                "caption": "Reusable components (e.g. sliders)"
            },        
            {
                "gif": "assets/Projects/SoftwareDev/Portfolio/ContactEmail.gif",
                "caption": "Demo of sending an email"
            },  
            {
                "gif": "assets/Projects/SoftwareDev/Portfolio/CircleAnimation.gif",
                "caption": "Animations and Responsive Interactions"
            },
            {
                "gif": "assets/Projects/SoftwareDev/Portfolio/Carousel.gif",
                "caption": "Carousel made with react and css"
            } 
        ],

        "thoughts": "For my first web development project, I’m proud of what I’ve accomplished. This experience taught me how HTML, CSS, and JavaScript work together to create functional and visually appealing websites. By using React, I discovered the power of frameworks in streamlining development, particularly through the creation of reusable code and web components. This project not only strengthened my technical skills but also deepened my appreciation for the creative and collaborative aspects of web development. I plan on working more on this portfolio as time goes by to continue improving and updating it with my latest projects."
    },
    {
        "title": "Automated School Calendar",
        "trailer": "",
        "task-section-title": "Software Developer",
        "job-title": "Software Developer",
        "tools": "(Python | Github | GitKraken | Google Calendar API)",
        "description": "An automated program designed to schedule my university classes directly into my Google Calendar",
        "game-link": "https://github.com/JMx36/IR24W-A3-G36",

        "title-background-image": "url('assets/Projects/SoftwareDev/Automated-Google-Calendar/title-background.jpg')",
        "task-section-background-color": "radial-gradient(circle farthest-side, #4F5762, #043266)",
        "jobs-section": [
            {
                "title": "Integrated Google APIs",
                "jobs": [
                    "Leveraged the Google Calendar API to automate the creation of events for all my classes during the academic quarter.",
                    "Configured authentication using OAuth 2.0 to securely access and update the user's calendar.",
                    "Customized event properties, such as start and end times, recurring schedules, and reminders, to align with class requirements."
                ]
            },
            {
                "title": "Data Parsing and Storage",
                "jobs": [
                    "Parsed data obtained from the school's website to extract class details such as course names, timings, locations, and instructors.",
                    "Utilized Python's datetime library to parse and manipulate time information for classes. Converted raw text data into structured datetime objects for consistent formatting and easy comparison.",
                    "Stored structured data in efficient data containers like namedtuple and dictionaries to enable easy manipulation and querying.",
                    "Implemented error handling and data validation to ensure the accuracy and consistency of the parsed information."
                ]
            },
            {
                "title": "Web Scraping with Beautiful Soup",
                "jobs": [
                    "Utilized the Beautiful Soup library to scrape HTML content from the school's website, extracting class schedules, class names, and locations.",
                    "Designed a simple yet effective scraping logic to navigate and parse dynamic or nested HTML structures effectively."
                ]
            }
        ],
 
        "gifs-section": 
        [
            {
                "gif": "assets/Projects/SoftwareDev/Automated-Google-Calendar/AutomatedCalendar.gif",
                "caption": "Demo"
            }
        ],

        "thoughts": "Developing this project was a rewarding experience, as it helped streamline a repetitive and time-consuming task, freeing up more time for other activities. It allowed me to deepen my understanding of the Google Calendar API, web scraping, and simulating user interactions, such as clicking buttons and entering text. While the project is functional, I plan to address areas for improvement, such as handling login failures and delayed website rendering, to achieve full automation."
    }
]